block retry {}

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.argocd-resources.argocd_application.application["grafana-test"] will be created
  + resource "argocd_application" "application" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = false

      + metadata {
          + generation       = (known after apply)
          + name             = "grafana-test"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
              + namespace = "test-deploy"
              + server    = "https://kubernetes.default.svc"
            }

          + source {
              + chart           = "grafana"
              + path            = "."
              + repo_url        = "https://grafana.github.io/helm-charts"
              + target_revision = "8.5.2"

              + helm {
                  + value_files = [
                      + "$values/values/grafana.yaml",
                    ]
                }
            }
          + source {
              + path            = "."
              + ref             = "values"
              + repo_url        = "https://git.sbercloud.tech/dsworks/infrastructure.git"
              + target_revision = "HEAD"
            }

          + sync_policy {
              + sync_options = [
                  + "CreateNamespace=true",
                ]

              + automated {
                  + prune     = true
                  + self_heal = true
                }

              + retry {}
            }
        }

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.argocd-resources.argocd_application.application["grafana-test"]: Creating...
╷
│ Error: Plugin did not respond
│ 
│ The plugin encountered an error, and failed to respond to the plugin6.(*GRPCProvider).ApplyResourceChange call. The plugin logs may contain
│ more details.
╵

Stack trace from the terraform-provider-argocd_v7.2.0 plugin:

panic: interface conversion: interface {} is nil, not map[string]interface {}

goroutine 145 [running]:
github.com/argoproj-labs/terraform-provider-argocd/argocd.expandApplicationSyncPolicy({0x10552d240, 0x140009cad80})
        github.com/argoproj-labs/terraform-provider-argocd/argocd/structure_application.go:366 +0x9bc
github.com/argoproj-labs/terraform-provider-argocd/argocd.expandApplicationSpec(0x140009ca0f0)
        github.com/argoproj-labs/terraform-provider-argocd/argocd/structure_application.go:43 +0x1f0
github.com/argoproj-labs/terraform-provider-argocd/argocd.expandApplication(_)
        github.com/argoproj-labs/terraform-provider-argocd/argocd/structure_application.go:16 +0xcc
github.com/argoproj-labs/terraform-provider-argocd/argocd.resourceArgoCDApplicationCreate({0x105b52180, 0x140009005b0}, 0x14000fa7f00, {0x1058a0680, 0x140000f8508})
        github.com/argoproj-labs/terraform-provider-argocd/argocd/resource_argocd_application.go:86 +0x94
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).create(0x1400099d960, {0x105b520d8, 0x140008f53b0}, 0x14000fa7f00, {0x1058a0680, 0x140000f8508})
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.35.0/helper/schema/resource.go:806 +0xe4
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).Apply(0x1400099d960, {0x105b520d8, 0x140008f53b0}, 0x14000313e10, 0x14001245080, {0x1058a0680, 0x140000f8508})
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.35.0/helper/schema/resource.go:937 +0x884
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*GRPCProviderServer).ApplyResourceChange(0x14000624b88, {0x105b520d8?, 0x140008f4ed0?}, 0x140000d5180)
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.35.0/helper/schema/grpc_provider.go:1155 +0xaa4
github.com/hashicorp/terraform-plugin-mux/tf5to6server.v5tov6Server.ApplyResourceChange({{0x105b70bd8?, 0x14000624b88?}}, {0x105b520d8, 0x140008f4ed0}, 0x0?)
        github.com/hashicorp/terraform-plugin-mux@v0.17.0/tf5to6server/tf5to6server.go:38 +0x58
github.com/hashicorp/terraform-plugin-mux/tf6muxserver.(*muxServer).ApplyResourceChange(0x140005fe500, {0x105b520d8?, 0x140008f4c00?}, 0x140000d5130)
        github.com/hashicorp/terraform-plugin-mux@v0.17.0/tf6muxserver/mux_server_ApplyResourceChange.go:36 +0x184
github.com/hashicorp/terraform-plugin-go/tfprotov6/tf6server.(*server).ApplyResourceChange(0x140004dd400, {0x105b520d8?, 0x140008f4210?}, 0x14000490000)
        github.com/hashicorp/terraform-plugin-go@v0.25.0/tfprotov6/tf6server/server.go:865 +0x2b4
github.com/hashicorp/terraform-plugin-go/tfprotov6/internal/tfplugin6._Provider_ApplyResourceChange_Handler({0x105a10be0, 0x140004dd400}, {0x105b520d8, 0x140008f4210}, 0x14001244380, 0x0)
        github.com/hashicorp/terraform-plugin-go@v0.25.0/tfprotov6/internal/tfplugin6/tfplugin6_grpc.pb.go:611 +0x1c0
google.golang.org/grpc.(*Server).processUnaryRPC(0x140001b6a00, {0x105b520d8, 0x140008f4180}, {0x105b63b80, 0x14000dc9520}, 0x14001384000, 0x14000efd200, 0x1078c3b18, 0x0)
        google.golang.org/grpc@v1.67.1/server.go:1394 +0xb78
google.golang.org/grpc.(*Server).handleStream(0x140001b6a00, {0x105b63b80, 0x14000dc9520}, 0x14001384000)
        google.golang.org/grpc@v1.67.1/server.go:1805 +0xb20
google.golang.org/grpc.(*Server).serveStreams.func2.1()
        google.golang.org/grpc@v1.67.1/server.go:1029 +0x8c
created by google.golang.org/grpc.(*Server).serveStreams.func2 in goroutine 102
        google.golang.org/grpc@v1.67.1/server.go:1040 +0x13c

Error: The terraform-provider-argocd_v7.2.0 plugin crashed!

This is always indicative of a bug within the plugin. It would be immensely
helpful if you could report the crash with the plugin's maintainers so that it
can be fixed. The output above should help diagnose the issue.
```